lisp/clbe/clbe-3.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-02 Thu 20:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Global Variables &amp; Assignment</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://www.akhanna.net"> HOME </a>
</div><div id="preamble" class="status">
<div id="logo"><a href="https://www.akhanna.net"Ashok Khanna</a></div>
</div>
<div id="content">
<h1 class="title">Global Variables &amp; Assignment</h1>
<p>
Previous: <a href="clbe-2.html">2. Symbols &amp; Data Objects</a>
</p>

<p>
Next: <a href="clbe-4.html">4. Input &amp; Output</a>
</p>

<p>
DEFPARAMETER and DEFVAR establish global variables, known more
technically as special or dynamic variables. These variables can be
accessed throughout a Lisp program.
</p>

<p>
If a local variable exists with the same name as a global variable, a
lexical closure will typically refer to the local variable. To avoid
confusion, we should always name special variables with leading and
trailing asterisks *, such as in the below examples.
</p>

<p>
DEFPARAMETER will unconditionally assign the value supplied to the
variable, while DEFVAR will only assign the value if it is not already
bound to the variable. A value must be supplied to the DEFPARAMETER
macro, whilst DEFVAR can establish a dynamic variable without
assigning it a value:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Establish an unbound variable</span>

(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">*x*</span>)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Assign the value 15 to X</span>

(<span style="color: #a020f0;">defparameter</span> <span style="color: #a0522d;">*x*</span> 15)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Does nothing as X already bound</span>

(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">*x*</span> 10)

</pre>
</div>

<p>
We can define global constants with DEFCONSTANT. Note that global
constants cannot be used as function parameters or rebound to a new
value at a later stage.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defconstant</span> <span style="color: #a0522d;">+my-constant+</span> 20)

</pre>
</div>

<div id="outline-container-org8c5ea0d" class="outline-2">
<h2 id="org8c5ea0d">General Purpose Assignment</h2>
<div class="outline-text-2" id="text-org8c5ea0d">
<p>
SETF is Lisp’s general purpose assignment macro that assigns a value
to a designated place (such as a variable). It is a very powerful
setter that can assign values to many different objects.
</p>

<p>
We won’t go into detail, but rather provide illustrative examples
throughout this guide. The syntax of SETF is as follows:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #a020f0;">setf</span> place value)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Set x to 10</span>

(setf x 10)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Set x to 1 and y to 2</span>

(setf x 1 y 2)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Same as (setf x (+ x 1))</span>

(incf x)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Same as (setf x (- x 1))</span>

(decf x)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Same as (setf x (+ x 10))</span>

(incf x 10)

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 24 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
